app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$wNMXkfZC3k2thUgvKDh4oOsFozXHT.pd0sjOqwgsDm.C0vvhC83LO"], ["updated_at", "2015-01-05 07:34:41.989862"], ["id", 688598839]]
---
  def update
  	if both_passwords_blank?
  		flash.now[:danger] = "Password/confirmation can't be blank"
  		render 'edit'
  	elsif @user.update_attributes(user_params)